# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR DEIM config derived from `deim_convnextsmall_dinov3_sta_l4_l_timm.yaml`.
# This variant keeps the same ConvNeXt-S DINOv3 backbone and DEIM-L hybrid encoder,
# but swaps the final decoder to DFineDecoder.
# ConvNeXt provides native P3/P4/P5 features at strides 8/16/32, so the STA
# detail branch used for single-scale ViT backbones is removed here.
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, nn.Identity, []] # 0 image anchor

  # Semantic path (timm ConvNeXt-S DINOv3).
  # Timm args: [out_ch, model_name, pretrained, out_indices, split]
  # Selected stages map naturally to P3/P4/P5 with channels 192/384/768.
  - [0, 1, Timm, [None, convnext_small.dinov3_lvd1689m, True, [1, 2, 3], True]] # 1
  - [1, 1, Index, [192, 1]] # 2 semantic P3
  - [1, 1, Index, [384, 2]] # 3 semantic P4
  - [1, 1, Index, [768, 3]] # 4 semantic P5

  # Project native ConvNeXt pyramid features to the DEIM-L hidden_dim=224.
  - [2, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 5 P3 proj
  - [3, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 6 P4 proj
  - [4, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 7 P5 proj

head:
  # DEIMv2-L HybridEncoder head: input_proj + AIFI + FPN/PAN.
  # Input projections remain identity because the fused backbone outputs are
  # already projected to hidden_dim=224 above.
  - [7, 1, nn.Identity, []] # 8 input_proj.2
  - [-1, 1, AIFI, [896, 8]]
  - [-1, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 10 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [6, 1, nn.Identity, []] # 12 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 14 fpn_blocks.0
  - [-1, 1, Conv, [224, 1, 1, None, 1, 1, False]] # 15 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [5, 1, nn.Identity, []] # 17 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 19 X3, fpn_blocks.1

  - [-1, 1, SCDown, [224, 3, 2, False]] # 20 downsample_convs.0
  - [[-1, 15], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 22 F4, pan_blocks.0

  - [-1, 1, SCDown, [224, 3, 2, False]] # 23 downsample_convs.1
  - [[-1, 10], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [224, 448, 112, 3]] # 25 F5, pan_blocks.1

  # DFineDecoder with the same L-sized width/depth as `deim_convnextsmall_dinov3_sta_l4_l_timm.yaml`.
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode]
  - [[19, 22, 25], 1, DFineDecoder, [nc, 224, 300, [3, 6, 3], 8, 4, 1792, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared"]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 50
