# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-FastViT instance segmentation model. Backbone + head identical to
# yolo26-fastvit.yaml; only the final detect-style layer is Segment26.

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  s: [1.0, 0.50, 1024]
  l: [5.0, 0.75, 1024]

backbone:
  - [-1, 1, Conv, [96, 3, 2]] # 0 P1/2 stem
  - [-1, 1, Conv, [96, 3, 2]] # 1 P2/4 stem
  - [-1, 2, FastViTBlock, [3]] # 2 stage1 P2/4
  - [-1, 1, Conv, [192, 3, 2]] # 3 P3/8 downsample
  - [-1, 2, FastViTBlock, [3]] # 4 stage2 P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5 P4/16 downsample
  - [-1, 2, FastViTBlock, [3]] # 6 stage3 P4/16
  - [-1, 1, Conv, [768, 3, 2]] # 7 P5/32 downsample
  - [-1, 1, MHSABlock, [6, 4]] # 8 stage4 P5/32
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22

  - [[16, 19, 22], 1, Segment26, [nc, 32, 256]] # Segment26(P3, P4, P5)
